In [2]:
import pandas as pd

## ways

iterrows()
itertuples()
index 
loc[] function
iloc[]
apply()

In [3]:
input_df = [{'name':'Sujeet', 'age':10},
            {'name':'Sameer', 'age':11},
            {'name':'Sumit', 'age':12}]
 
df = pd.DataFrame(input_df)
df

     name  age
0  Sujeet   10
1  Sameer   11
2   Sumit   12

#### iterrows()-->iterate over rows of df as (index,series) pair--->index--->index of row/tuple if multiindex rows,series-->data of row as series

In [15]:
dict(df.iterrows())

{0: name    Sujeet
 age         10
 Name: 0, dtype: object,
 1: name    Sameer
 age         11
 Name: 1, dtype: object,
 2: name    Sumit
 age        12
 Name: 2, dtype: object}

In [19]:
for index,series in df.iterrows():
    print(index,series,sep='\n')

0
name    Sujeet
age         10
Name: 0, dtype: object
1
name    Sameer
age         11
Name: 1, dtype: object
2
name    Sumit
age        12
Name: 2, dtype: object

In [22]:
for index,series in df.iterrows():
    print(series['name'],series['age'],sep='\t')

Sujeet	10
Sameer	11
Sumit	12

### itertuples()

In [ ]:
itertuples(index=True,name='Pandas')--->iterate over rows of df and return namedtuple
index=True-->first elementt of returned namedtuple will be index 
name='Pandas'--->name of returned namedtupple is Pandas 
name=None to return regular tuples.

In [26]:
list(df.itertuples())

[Pandas(Index=0, name='Sujeet', age=10),
 Pandas(Index=1, name='Sameer', age=11),
 Pandas(Index=2, name='Sumit', age=12)]

In [27]:
list(df.itertuples(index=False))

[Pandas(name='Sujeet', age=10),
 Pandas(name='Sameer', age=11),
 Pandas(name='Sumit', age=12)]

In [28]:
list(df.itertuples(name=None))

[(0, 'Sujeet', 10), (1, 'Sameer', 11), (2, 'Sumit', 12)]

In [30]:
for row in df.itertuples():
    print(row)

Pandas(Index=0, name='Sujeet', age=10)
Pandas(Index=1, name='Sameer', age=11)
Pandas(Index=2, name='Sumit', age=12)

In [33]:
for row in df.itertuples():
    print(getattr(row,'name'),getattr(row,'age'),sep='\t')

Sujeet	10
Sameer	11
Sumit	12

### df.index

In [5]:
list(df.index)

[0, 1, 2]

In [12]:
for i in df.index:
    print(df['name'][i],df['age'][i],sep='\t')

Sujeet	10
Sameer	11
Sumit	12

In [34]:
data = {'Name': ['Ankit', 'Amit',
                 'Aishwarya', 'Priyanka'],
        'Age': [21, 19, 20, 18],
        'Stream': ['Math', 'Commerce',
                   'Arts', 'Biology'],
        'Percentage': [88, 92, 95, 70]}
 
# Convert the dictionary into DataFrame
df = pd.DataFrame(data, columns=['Name', 'Age', 
                                 'Stream', 'Percentage'])
df

        Name  Age    Stream  Percentage
0      Ankit   21      Math          88
1       Amit   19  Commerce          92
2  Aishwarya   20      Arts          95
3   Priyanka   18   Biology          70

In [39]:
for i in df.index:
    print(df['Name'][i],df['Age'][i],df['Stream'][i],df['Percentage'][i])

Ankit 21 Math 88
Amit 19 Commerce 92
Aishwarya 20 Arts 95
Priyanka 18 Biology 70

### loc[]

In [41]:
df

        Name  Age    Stream  Percentage
0      Ankit   21      Math          88
1       Amit   19  Commerce          92
2  Aishwarya   20      Arts          95
3   Priyanka   18   Biology          70

In [55]:
df.loc[:2]

        Name  Age    Stream  Percentage
0      Ankit   21      Math          88
1       Amit   19  Commerce          92
2  Aishwarya   20      Arts          95

In [56]:
for i in range(len(df)):
    print(df.loc[i,'Name'],df.loc[i,'Age'])

Ankit 21
Amit 19
Aishwarya 20
Priyanka 18

## iloc[]

In [57]:
for i in range(len(df)):
    print(df.iloc[i,1],df.iloc[i,0])

21 Ankit
19 Amit
20 Aishwarya
18 Priyanka

## apply()

In [64]:
df.apply(lambda x:x['Name'] + "    " + str(x['Percentage']) ,axis=1)

0        Ankit    88
1         Amit    92
2    Aishwarya    95
3     Priyanka    70
dtype: object